import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function AnimalsTh(){
    const words = ["สุนัข", "แมว", "นก", "กบ", "งู", "เสือ", "สิงโต", "ยุง", "นกกระจอกเทศ", "เสือดำ", "ยีราฟ", "แมลงวัน", "แมงมุม", "แมงป่อง", "แมงกะพรุน", "ปลา", "วาฬ", "พะยูน", "ฉลาม", "งูเหลือม", "นกพิราบ", "แกะ", "แพะ", "วัว", "ควาย", "แรด", "ตัวเงินตัวทอง", "ตะกวด", "จระเข้", "หงส์", "ห่าน", "กา", "คางคก", "จิ้งจก", "หนู", "ตุ๊กแก", "แมลงสาบ", "เขียด", "ซาลาแมนเดอร์", "กระต่าย", "นกเค้าแมว", "เต่า", "แมวน้ำ", "ม้าน้ำ", "เต่าทะเล", "ตะพาบ", "ตะขาบ", "ผึ้ง", "แตน", "ตัวต่อ", "กระรอก", "ปลาปักเป้า", "ช้าง", "ปู", "กุ้ง", "กั้ง", "ม้า", "ลา", "กระทิง", "หนูนา", "จิ้งหรีด", "หิ่งห้อย", "อึ่งอ่าง", "จิ้งเหลน", "จากัวร์", "เสือชีต้าห์", "สุนัขจิ้งจอก", "จิงโจ้น้ำ", "จิงโจ้", "ปลาหมึก", "ลิง", "แมลงหวี่", "จั๊กจั่น", "นกอินทรี", "ผีเสื้อ", "ด้วง", "หมี", "หมีขั้วโลก", "ค้างคาว", "งูสิง", "หมู", "ไก่", "หอย", "ตั๊กแตน", "กวาง", "แมลงปอ", "หนอน", "มด", "หอยทาก", "หอยลาย", "เพนกวิน", "เต่าทอง", "งูเห่า", "ไส้เดือน", "นกยูง", "นกนางนวล", "นาก", "อูฐ", "ปลาดาว"];
    return (<QuestionsTh answers={words} category="สัตว์ต่างๆ" redirect="/th/animals"/>)
}