import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function BaliSanskritLoanwords(){
  const words = ["มนุษย์","อาทิตย์","อากาศ","อาหาร","กษัตริย์","สัมภาษณ์","ปรารถนา","กีฬา","กรีฑา","วิเคราะห์","สังเคราะห์","อุตส่าห์","พยัคฆ์","อัคคี","เขต","จุฬา","อธิษฐาน","บริบูรณ์","ศึกษา","วิทยุ","ทฤษฎี","วิเศษ","สถาน","รัศมี","ภรรยา","วิชา","วิทยา","สามัญ","สัญญาณ","ปัจจุบัน","ปกติ","ปัญญา","บุปผา","ธรรม","กรรม","สวรรค์","อาศัย","อักษร","ขณะ","พัฒนา","วัฒนา","พิเศษ","วุฒิ","ทุกข์","บุตร","เกษตร","มหัศจรรย์","อัศจรรย์","เกษียณ","ทักษิณ","พัสดุ","ไวยากรณ์","พฤติกรรม","ศัพท์","ฤทัย","พยายาม","ประพฤติ","ทรัพย์","ศรี","ศาสนา","ประถม","มัธยม","บุรุษ","สตรี","ประเทศ","ประโยค","อาจารย์","ศาสตร์","จันทร์","จักรวาล","เพศ","มนตรี","มิตร","ไพฑูรย์","อุทยาน","ปัจจัย","บุคคล","เมตตา","ปรากฏ","วิทยาลัย"];
  return (<QuestionsTh answers={words} category="คำที่มาจากภาษาบาลี-สันสกฤต" redirect="/th/bali-sanskrit-loanwords"/>)
}