import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function ChatWithFriends(){
  const words = ["ใกล้ถึงยัง","กินอะไรดี","ไม่มีตังเลยอ่ะ","ไปเที่ยวกันมั้ย","น่ารักจังเลย","คิดถึงจังเลย","แปปนะ อาบน้ำอยู่","เคยดูหนังเรื่องนี้ป่ะ","ไม่ว่างอ่ะ ไว้วันหลังได้ป่ะ","ขอยืมตังหน่อย","ไปกินหมูกระทะกันมั้ย","ใกล้จะออกจากบ้านละ","อุ้ย ดูคนนี้สิ หล่อมากเลย","เตะบอลกันมั้ย","ช่วงนี้เปลี่ยนไปเยอะเลยนะ","สวัสดี เป็นไงบ้าง","กินร้านนี้สิ ร้านนี้อร่อยนะ","พอดีต้องอ่านหนังสือเตรียมสอบอ่ะ","ไม่ได้เจอกันนาน สบายดีป่ะ"];
  return (<QuestionsTh answers={words} category="ประโยคไว้คุยกับเพื่อน" redirect="/th/chat-with-friends"/>)
}