import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function ChineseLoanwords(){
  const words = ["ซาเล้ง","เก้าอี้","โต๊ะ","กงสี","กงเต็ก","เก๋ง","ก๊ก","ก๊วน","เกี๊ยว","กุ๊ย","ก๋วยเตี๋ยว","กางเกง","เกี๊ยะ","เจ๋ง","เจ๊ง","โจ๊ก","หุ้น","โป๊ยเซียน","เจ๊ก","เจ๊","เต้าเจี้ยว","บะหมี่","ตะหลิว","ลิ้นจี่","ซินแส","เต้าฮวย","หมึก","หมวย","ตงฉิน","ซี้ซั้ว","งิ้ว","เซ็งลี้","ไต้ก๋ง","ซีอิ๊ว","ปุ๋ย","โรงเตี๊ยม","โป๊ะ","ตู้","ต๋ง","เตียง","เต้าทึง","เต้าส่วน","โอเลี้ยง","ซูฮก","จับฉ่าย","ตึก","โสหุ้ย","เฮีย","ซ้อ"];
  return (<QuestionsTh answers={words} category="คำที่มาจากภาษาจีน" redirect="/th/chinese-loanwords"/>)
}