import React from "react";
import "../../App.scss";
import Questions from "../components/questions";

export default function DrinksTh(){
  const words = ["น้ำเปล่า","ชา","กาแฟ","ชานมไข่มุก","คาปูชิโน","อเมริกาโน","นม","นมปั่น","โซดา","เบียร์","ไวน์","เบียร์ข้าวสาลี","ชาไทย","มอคค่า","เอสเปรซโซ","แฟรบปูชิโน","โมฮิโต้","น้ำส้ม","น้ำผลไม้","น้ำแอปเปิล","มาร์ตินี","วิสกี้","ค็อกเทล","สมูทตี้","คอมบูชา","เตกีล่า","น้ำมะนาว","ชาอูหลง","โซจู","น้ำมะพร้าว","น้ำเต้าหู้","นมอัลมอนด์","ชานม","ชามะนาว","โอเลี้ยง","เก๊กฮวย","น้ำมะตูม","ลาเต้","นมเปรี้ยว","น้ำแร่","โกโก้","แชมเปญ","น้ำใบบัวบก","น้ำผลไม้ปั่น","นมชมพู","น้ำกระเจี๊ยบ","รูทเบียร์","จับเลี้ยง","เหล้า","เหล้าขาว","สาโท","ชามะลิ","ชาเขียว","น้ำอ้อย","น้ำผัก","เครื่องดื่มชูกำลัง","ชาชัก"];
  return (<Questions answers={words} category="เครื่องดื่ม" redirect="/th/drinks"/>)
}