import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function EnglishLoanwords(){
  const words = ["ฟรี","แพ็กเกจ","บอล","ช็อกโกแลต","คุกกี้","เครดิต","เดบิต","เทอม","แท็กซี่","เช็ค","เชิ้ต","เคาน์เตอร์","แคปซูล","การ์ตูน","โควตา","เต็นท์","ดีเปรสชัน","เทคโนโลยี","แกลลอน","คอนเสิร์ต","ไดโนเสาร์","เซลล์","คลินิก","เกม","กราฟ","ไมโครโฟน","คอมพิวเตอร์","ไมโครเวฟ","ยีราฟ","ยิปซัม","ไมล์","เรดาร์","วัคซีน","วิตามิน","ลิปสติก","โน้ต","ฟิสิกส์","แก๊ส","ครีม","คอนกรีต","บล็อก","พลาสติก","เปอร์เซ็นต์","เกียร์","แก๊ง","นีออน","แบคทีเรีย","ไวรัส","ไฟล์","เว็บไซต์","ออกซิเจน","แฟชั่น","แอร์","บอลลูน","บาร์","แบตเตอรี่","เค้ก","คอร์ด","ฟิล์ม","ลิฟต์","ปลั๊ก","โปรแกรม","ปั๊ม","คิว","ซอส","ช็อก","เทป","โทเค็น","วิดีโอ","สวิตซ์","แทรกเตอร์","โชว์","เชียร์","ชอล์ก","สแกน","ฟังก์ชัน","บอร์ด"];
  return (<QuestionsTh answers={words} category="คำที่มาจากภาษาอังกฤษ" redirect="/th/english-loanwords"/>)
}