import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function ETCSongsTh(){
  const words = ["โปรดอย่าเคืองผมเลย","เจ้าชายนิทรา","ลืม","มากกว่าสิ่งใด","ไม่จริงหรอก","แด่เธอ (คืนสุดท้าย)","คือเธอ","ใกล้กว่านี้","อดทนรอ","งามแต๊แม่ปิง","Etc. (ecstasy)","Enter","เปลี่ยน","เพราะเธอ","ฉวยโอกาส","Out of Control","ต้องมีสักครั้ง","ผิดที่ฉันเอง","จริง จริง","เธอคือใคร","รักบันดาล","พร้อมรับความเสี่ยง","อย่าทำเหมือนรัก","Bring It Back","รักคนเอาแต่ใจ","อย่าถาม","นางฟ้า","สิ่งมีชีวิตที่เรียกว่าหัวใจ","นาทีสุดท้าย","Chill","หมดเวลา","เพราะเธอ..คือคำตอบ","ไม่อยากจะรับรู้","ฝาก","รักครั้งเดียว","เจ็บและชินไปเอง","ปรัชญา 8 บิต","ใครนิยาม","ปัจจุบัน","หมุน","เรื่องงมงาย","เธอบนนั้น","คนที่ตามหา","ชุดวิวาห์","Soft Touch With Your Love (สัมผัส)","ที่ว่างข้างๆตัว","ฝัง(ใน)ใจ","LIES","เข้าข้างตัวเอง (อีกแล้ว)","กอดได้ไหม","เรื่องธรรมดาเรื่องใหม่","รอยยิ้มที่หัวใจ","เธอคนเดียว (Forever Love)","ความจริงเป็นสิ่งที่ตาย","ฮักเมาเมาฮัก","อุตุนิยมวิทยา","จูบ","ขอบคุณที่เลือกฉัน","สุดท้ายคือเธอ","ใครเจ็บกว่า","ไม่ใช่คนที่ใช่","อีกครึ่งของหัวใจ","ไม่รักคนอื่น","แค่คำเดียว","Beside You","เหมือนเราเคยรักกัน","ขอบฟ้าไม่กว้างเกิน","พบรัก","คือเธอใช่ไหม","คนไร้หัวใจ","อีกไม่นาน ฉันจะไป","ดอกไม้แห้ง"];
  return (<QuestionsTh answers={words} category="เพลงวง ETC" redirect="/th/etc-songs"/>)
}