import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function HolidaysTh(){
  const words = ["วันขึ้นปีใหม่","วันสงกรานต์","วันตรุษจีน","วันวิสาขบูชา","วันอาสาฬหบูชา","วันพ่อ","วันแม่","วันจักรี","วันสิ้นปี","วันมาฆบูชา","วันเข้าพรรษา","วันออกพรรษา","วันรัฐธรรมนูญ","วันพืชมงคล","วันฉัตรมงคล","วันแรงงาน","วันครู","วันเด็ก","วันวาเลนไทน์","วันสตรีสากล","วันคริสต์มาส","วันฮาโลวีน","วันลอยกระทง","วันอัฏฐมีบูชา","วันไหว้พระจันทร์","วันเชงเม้ง","วันสารทจีน","วันอนามัยโลก","วันงดสูบบุหรี่โลก","วันปิยมหาราช","วันสุนทรภู่","วันวิทยาศาสตร์แห่งชาติ","วันรพี","วันต่อต้านยาเสพติดโลก","วันภาษาไทยแห่งชาติ","วันคุ้มครองโลก","วันโกหกโลก"];
  return (<QuestionsTh answers={words} category="วันสำคัญ" redirect="/th/holidays"/>)
}