import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function HouseholdItemsTh(){
  const words = ["ไม้กวาด","เก้าอี้","โต๊ะ","ไม้แขวนเสื้อ","ตู้เสื้อผ้า","คอมพิวเตอร์","แก้วน้ำ","กุญแจ","เตียง","โซฟา","ผ้าม่าน","หน้าต่าง","โทรศัพท์","หวี","ไม้ถูพื้น","หมอน","ผ้าเช็ดตัว","ผ้าเช็ดหน้า","ผ้าห่ม","ฟองน้ำ","บันได","แปรงสีฟัน","ยาสีฟัน","สบู่","แชมพู","ทีวี","คอมพิวเตอร์","ลิ้นชัก","ตู้เก็บของ","ประตู","พรม","พรมเช็ดเท้า","ผ้าปูที่นอน","กระจก","ตะเกียง","พัดลม","นาฬิกา","ผ้าขนหนู","อ่างล้างหน้า","อ่างอาบน้ำ","รูปภาพ","รีโมต","หนังสือ","สมุด","กระเป๋า","สายชาร์จ","หูฟัง","แบตเตอรี่","ทิชชู่","กระดาษ","มีดโกน","แอร์","ราวตากผ้า","ไม้หนีบผ้า","ที่หนีบผม","ไดร์เป่าผม","ครีมอาบน้ำ","โคมไฟ","ขวด","ชั้นวางของ","ปฏิทิน","ผงซักฟอก","น้ำยาล้างห้องน้ำ","น้ำยาล้างจาน","เครื่องชั่งน้ำหนัก","เครื่องซักผ้า","เตารีด","แฟ้ม","ดินสอ","ปากกา","ไฟฉาย","ไม้บรรทัด","ยางลบ","ยางรัดของ","ถุงผ้า","แจกัน","สเปรย์","ค้อน","ไขควง"];
  return (<QuestionsTh answers={words} category="ของใช้ในบ้าน" redirect="/th/household-items"/>)
}