import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function KitchenwareTh(){
  const words = ["ถ้วย","แก้ว","หม้อ","กระทะ","กระบวย","ช้อน","ส้อม","มีด","ปังตอ","กระทะใบบัว","ตะแกรง","ครก","สาก","ทัพพี","ตะหลิว","ชาม","จาน","ถาด","เขียง","หม้อหุงข้าว","ไมโครเวฟ","เครื่องปั่น","หม้อทอดไร้น้ำมัน","ตู้เย็น","เตาอบ","หม้อนึ่ง","พิมพ์อบขนม","ตู้กับข้าว","เครื่องปั่นอาหาร","กระชอน","ที่เปิดขวด","ตะกร้อมือ","ที่คีบ","ตะแกรง","ตะกร้อลวก","กระติกน้ำร้อน","คูลเลอร์"];
  return (<QuestionsTh answers={words} category="เครื่องครัว" redirect="/th/kitchenware"/>)
}