import React from "react";
import "../../App.scss";
import Questions from "../components/questions";

export default function MusicalInstrumentsTh(){
    const words = ["เปียโน", "กีต้าร์", "กลอง", "กลองไฟฟ้า", "อูคูเลเล่", "ไวโอลิน", "เชลโล", "คีย์บอร์ด", "อิเล็กโทน", "เบส", "วิโอลา", "ดับเบิลเบส", "ฮาร์ป", "แบนโจ", "แมนโดลิน", "ลูท", "ไลร์", "กลองชุด", "กลองทิมปานี", "กลองใหญ่", "กลองเล็ก", "แทมบูรีน", "ฉาบ", "ฉิ่ง", "เบลไลรา", "แซกโซโฟน", "ไซโลโฟน", "ไวบราโฟน", "ไลน์เบล", "ไทรแองเกิล", "คาสทาเนท", "มาราคัส", "คาบาซา", "มาริมบา", "คาวเบล", "ระฆัง", "ระฆังราว", "ออร์แกน", "เมโลเดียน", "แอคคอร์เดียน", "ฮาร์ปซิคอร์ด", "แคลฟวิคอร์ด", "เมาท์ออแกน", "ฟลูต", "โอโบ", "คลาริเน็ต", "บาสซูน", "รีคอร์เดอร์", "ปิคโคโล่", "ทรอมโบน", "ทรัมเป็ต", "ทูบา", "ฟลูเกลฮอร์น", "เฟรนช์ฮอร์น", "คอร์เน็ท", "ซูซาโฟน", "ยูโฟเนียม", "จะเข้", "กระจับปี่", "ปี่", "พิณ", "พิณเพียะ", "ซอ", "ซอด้วง", "ซออู้", "ซอสามสาย", "สะล้อ", "ระนาด", "ระนาดเอก", "ระนาดทุ้ม", "ฆ้อง", "โทน", "ขิม", "ขลุ่ย", "ขลุ่ยเพียงออ"];
    return (<Questions answers={words} category="เครื่องดนตรี" redirect="/th/musical-instruments"/>)
}