import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function OccupationsTh(){
  const words = ["อาจารย์","นักร้อง","นักแสดง","พิธีกร","นักพัฒนาเว็บไซต์","นักดนตรี","ผู้จัดการ","ผู้กำกับภาพยนตร์","พนักงานขายของ","เชฟ","โปรแกรมเมอร์","นายแบบ","นางแบบ","นักโภชนาการ","นักการเมือง","เทศกิจ","ตำรวจ","ทหาร","นักวิเคราะห์","ผู้บริหาร","ผู้บริหารระดับสูง","ผู้จัดการ","นักการตลาด","นักกีฬา","นักเรียน","นักศึกษา","นักเปียโน","นักกีตาร์","สถาปนิก","วิศวกร","ศิลปิน","จิตรกร","แพทย์","หมอ","พยาบาล","นักโฆษณา","ดีเจ","วีเจ","คณบดี","อธิการบดี","นักการทูต","นักธุรกิจ","นักออกแบบ","ผู้ช่วย","นักดับเพลิง","นักธรณีวิทยา","นักโบราณคดี","มัคคุเทศก์","ข้าราชการ","เจ้าหน้าที่","ยาม","ช่างแอร์","ช่างซ่อมรถ","ผู้ประกอบการ","นักวิทยาศาสตร์","นักแสดงตลก","อินฟลูเอนเซอร์"];
  return (<QuestionsTh answers={words} category="อาชีพ" redirect="/th/occupations"/>)
}