import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function PlacesTh(){
  const words = ["โรงเรียน","บ้าน","มหาวิทยาลัย","วิทยาลัย","โรงละคร","โรงภาพยนตร์","โรงพยาบาล","ซูเปอร์มาร์เก็ต","ห้างสรรพสินค้า","ร้านค้า","สนามบิน","ร้านขายยา","ใจกลางเมือง","พิพิธภัณฑ์","วัด","โบสถ์","อพาร์ทเมนท์","หอพัก","ร้านอาหาร","สำนักงาน","สวนสนุก","สตูดิโอ","คลินิก","ธนาคาร","สถานีตำรวจ","ร้านหนังสือ","ปั๊มน้ำมัน","ร้านขนมปัง","ที่จอดรถ","โรงแรม","สถานีดับเพลิง","สวนสาธารณะ","ร้านสะดวกซื้อ","สนามกีฬา","สวนสัตว์","เรือนจำ","สถานีรถไฟ","สถานีรถไฟใต้ดิน","ที่ทำการไปรษณีย์","ห้องสมุด","ตลาด","ห้องโถง","ร้านกาแฟ","คุก","ร้านนวด","ร้านเหล้า"];
  return (<QuestionsTh answers={words} category="สถานที่" redirect="/th/places"/>)
}