import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function SeasoningTh(){
  const words = ["ซอส","น้ำปลา","เกลือ","น้ำตาล","ผงชูรส","พริกป่น","น้ำปลาพริก","ซีอิ๊ว","ซีอิ๊วขาว","ซีอิ๊วดำ","ซอสหอยนางรม","น้ำมันงา","น้ำพริก","พริกไทยป่น","น้ำส้มสายชู","พริก","ผักชี","ถั่วลิสง","น้ำจิ้ม","กระเทียม","หอมเจียว","กระเทียมเจียว","ผงกะหรี่","น้ำตาลปีบ","น้ำมะนาว","น้ำมะขาม","น้ำจิ้มแจ่ว","น้ำตาลทราย","ต้นหอม","หอมใหญ่","เทอริยากิ","โรสแมรี่","ออริกาโน่","ซอสมะเขือเทศ","ซอสพริก","โชยุ","วาซาบิ","น้ำพริกเผา","กะทิ","เต้าเจี้ยว","ปลาร้า","กะปิ","มายองเนส","ครีม"];
  return (<QuestionsTh answers={words} category="เครื่องปรุง" redirect="/th/seasoning"/>)
}