import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function SpaceTh(){
  const words = ["ดวงอาทิตย์","ดวงจันทร์","ดาว","ดาวเคราะห์","ระบบสุริยะ","หลุมดำ","จักรวาล","ดาวพุธ","ดาวศุกร์","ดาวอังคาร","ดาวพฤหัสบดี","ดาวเสาร์","ดาวเนปจูน","ดาวยูเรนัส","ดาวพลูโต","สนามแม่เหล็ก","พายุสุริยะ","ดาวฤกษ์","อุกกาบาต","ดาวหาง","นักบินอวกาศ","ขยะอวกาศ","ยานอวกาศ","จรวด","ดาวเทียม","กระสวยอวกาศ","บิกแบง","โลก","กล้องโทรทรรศน์","ดาวเคราะห์น้อย","ทางช้างเผือก","จันทรุปราคา","สุริยุปราคา","วงโคจร","เรดาร์","สถานีอวกาศ","จานบิน","มนุษย์ต่างดาว","ดาวตก"];
  return (<QuestionsTh answers={words} category="อวกาศ" redirect="/th/space"/>)
}