import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function TattooColour(){
  const words = ["เพลงของเรา","จำทำไม","Cinderella","ขาหมู","ฉันรักเธอ","โกหก","ฟ้า","แปรผกผัน","สุดท้ายแล้วเธอต้องไป","ฝากที","เกาะร้าง ห่างรัก","สิ่งที่แสนดี","อากาศร้อนๆ","เธอไม่อาจเอารักไปจากหัวใจ","One Night Stand","รอยจูบ","รักหรือเปล่า","กลัว","Like","รู้มั้ยจ๊ะ","โอกาสสุดท้าย","นกน้อย","เปิดเพลงไหน เปิดเมื่อไหร่ ก็ยังสวยงาม","บ้านของฉัน","เพลงสุดท้าย","งอน","ก่อนจะรักใครดูให้ดีก่อน","คนสวย","เรือสำราญ","ลับสุดยอด","แค่นั้นจริงๆ","รักแรกพบ","ยอมแล้ว","แล้วแต่","พรสวรรค์","ฝากลม","เธอต้องมีฉัน","คืนนี้สบาย","จากกันด้วยดี","เจ็บแล้วไม่จำ","เจ้าพระยา","เผลอไป","คนอ่อนไหว","ซ่อนหา","อยากรู้เสมอมา","หลับลึก","Anyone Before","เนรมิตเอง","รถไฟ","No. 1","ที่ประจำ","เย็นไว้ก่อน","รองเท้าเก่า","ยังอีก","คิดถึงก่อน...ชนะ","วัยทอง","Morning Man"];
  return (<QuestionsTh answers={words} category="เพลงวง Tattoo Colour" redirect="/th/tattoo-colour"/>)
}