import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function ThaiComedyFilms(){
  const words = ["พี่มาก..พระโขนง","ไอฟาย..แต๊งกิ้ว..เลิฟยู้","ซักซี้ด ห่วยขั้นเทพ","อ้าย..คนหล่อลวง","ระวัง..สิ้นสุดทางเพื่อน","ATM เออรัก เออเร่อ","เมย์ไหน ไฟแรงเฟร่อ","น้อง.พี่.ที่รัก","กวน มึน โฮ","ไบค์แมน ศักรินทร์ตูดหมึก","แฟนฉัน","บุพเพสันนิวาส 2","พี่นาค 2","อีเรียมซิ่ง","เฮ้ย! ลูกเพ่ นี่ลูกพ่อ","แสบสนิท ศิษย์ส่ายหน้า","หลวงพี่เท่ง","แหยม ยโสธร","มนต์เลิฟสิบหมื่น","หอแต๋วแตก","โกยเถอะโยม","มิดไมล์","คุณนายโฮ","จำเนียร วิเวียน โตมร","โหดหน้าเหี่ยว","ว้อ หมาบ้ามหาสนุก","สุดเขตสเลดเป็ด","ฟ้าใส ใจชื่นบาน","หลวงพี่แจ๊ส 4G","หลวงพี่แจ๊ส 5G","รถไฟฟ้า มาหานะเธอ","หลวงพี่เท่ง","ตุ๊ดซี่ส์ แอนด์ เดอะเฟค","ป๊าด 888 แรงทะลุนรก","ตั๊ดสู้ฟุด","มะหมา 4 ขาครับ","มะหมา 2","เมล์นรก หมวยยกล้อ","ขุนแหย","ความลับนางมารร้าย","เลิฟอะรูมิไลค์ รักอะไรไม่รู้"];
  return (<QuestionsTh answers={words} category="ภาพยนตร์ตลกไทย" redirect="/th/thai-comedy-films"/>)
}