import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function ThaiDessertsTh(){
    const words = ["ขนมครก", "กล้วยบวชชี", "ทองหยิบ", "ทองหยอด", "ฝอยทอง", "ขนมเบื้อง", "ขนมไข่", "ข้าวเหนียวมะม่วง", "ขนมชั้น", "ขนมตาล", "กะละแม", "สาคู", "ขนมเทียน", "กระยาสารท", "กล้วยแขก", "แกงบวด", "กลีบลำดวน", "ขนมกง", "ขนมกรอก", "ขนมก้อ", "ขนมกุสรัง", "ขนมเกสรลำเจียก", "ขนมขี้หนู", "ขนมแก้อาม", "ขนมเปียกปูน", "ขนมจาก", "โรตี", "ขนมต้ม", "ขนมถ้วย", "ขนมถ้วยฟู", "ขนมถั่วแปป", "ขนมเปี๊ยะ", "ขนมบ้าบิ่น", "เฉาก๊วย", "น้ำแข็งไส", "ทองเอก", "ขนมลา", "ขนมหม้อแกง", "มะม่วงกวน", "ขนมฝรั่งกุฎีจีน", "จ่ามงกุฎ", "ครองแครงน้ำกะทิ", "ทับทิมกรอบ", "ข้าวเหนียวสังขยา", "ขนมใส่ไส้", "ข้าวต้มมัด", "สังขยาฟักทอง", "บัวลอย", "ทองม้วน", "วุ้นกะทิ", "สังขยา", "ข้าวจี่", "ข้าวหลาม", "เต้าฮวย", "ถั่วเขียวต้มน้ำตาล", "ดาราทอง", "ขนมผิง", "ขนมหัวล้าน", "โรตีสายไหม", "ขนมถังแตก", "อาลัว", "ซ่าหริ่ม", "ข้าวเม่า", "ลูกชุบ"];
    return (<QuestionsTh answers={words} category="ขนมไทย" redirect="/th/thai-desserts"/>)
}