import React from "react";
import "../../App.scss";
import QuestionsTh from "../components/questions";

export default function WeatherTh(){
  const words = ["แดดออก","เมฆ","พายุ","ฝนตก","ลมแรง","อากาศร้อน","หิมะตก","อากาศหนาว","ไต้ฝุ่น","หมอก","ฝุ่น","พายุฝนฟ้าคะนอง","ลูกเห็บ","ฟ้าหลัว","เฮอริเคน","ไซโคลน","อบอุ่น","ฝนปรอย","ฝนตกหนัก","ท้องฟ้าแจ่มใส","ท้องฟ้า","มรสุม","ทอร์นาโด","น้ำท่วม","น้ำท่วมฉับพลัน","น้ำป่าไหลหลาก","พายุฤดูร้อน","ลม","อุณหภูมิ","อากาศเย็น","องศาเซลเซียส","องศาฟาเรนไฮต์","อากาศชื้น","หยาดน้ำฟ้า","ฤดูกาล","ดีเปรสชัน","ฤดูร้อน","ฤดูหนาว","ฤดูใบไม้ผลิ","ฤดูใบไม้ร่วง","ฤดูฝน","ฤดูแล้ง","แห้งแล้ง","อากาศ","ภูมิอากาศ","ควัน","มีเมฆบางส่วน","มีเมฆมาก","พายุหิมะ","ความชื้น","คลื่นความร้อน","คลื่นความเย็น","น้ำท่วม","ไฟป่า"];
  return (<QuestionsTh answers={words} category="สภาพอากาศ" redirect="/th/weather"/>)
}