export const cateLists = {
  foodsZh: [
    {category: "甜点",link: "/zh/desserts", words:["巧克力","冰淇淋","蛋糕","饼干","月饼","馅饼","年糕","马卡龙","布丁"]},
    {category: "食物",link: "/zh/foods", words:["炸酱面","北京烤鸭","小笼包","辣子鸡","火锅","宫保鸡丁","面条","包子","麻婆豆腐","麻辣","馒头","扬州炒饭","炒饭","肉排","比萨","沙拉","炸鸡","寿司","海南鸡饭","烤鸡","米饭","咖喱","汤","酸辣汤","炒面","意大利面","豆腐","卤肉饭","馄饨"]},
    {category: "饮料",link: "/zh/drinks", words:["饮水","茶","咖啡","珍珠奶茶","卡布奇诺","美式咖啡","牛奶","奶昔","汽水","啤酒","葡萄酒","摩卡","浓缩咖啡","星冰乐","莫吉托","橙汁","果汁","苹果汁","马提尼酒","威士忌酒","鸡尾酒","冰沙","红茶菌","龙舌兰酒","柠檬汁","乌龙茶","烧酒","豆浆","杏仁奶","奶茶","柠檬茶","拿铁","酸奶","可乐","香槟酒","白酒","茉莉花茶","绿茶","伯爵茶","黑茶","白茶","玛奇朵","红茶","普洱茶"]},
  ],
  geographyZh: [
    {category: "世界上的国家",link: "/zh/countries-in-the-world", words:["阿富汗","阿尔巴尼亚","阿尔及利亚","安道尔","安哥拉","安提瓜和巴布达","阿根廷","亚美尼亚","澳大利亚","奥地利","阿塞拜疆","巴哈马","巴林","孟加拉国","巴巴多斯","白俄罗斯","比利时","伯利兹","贝宁","不丹","玻利维亚","波斯尼亚和黑塞哥维那","博茨瓦纳","巴西","文莱","保加利亚","布基纳法索","布隆迪","科特迪瓦","佛得角","柬埔寨","喀麦隆","加拿大","中非","乍得","智利","中国","哥伦比亚","科摩罗","刚果共和国","哥斯达黎加","克罗地亚","古巴","塞浦路斯","捷克","刚果民主共和国","丹麦","吉布提","多米尼克","多米尼加","厄瓜多尔","埃及","萨尔瓦多","赤道几内亚","厄立特里亚","爱沙尼亚","斯威士兰","埃塞俄比亚","斐济","芬兰","法国","加蓬","冈比亚","格鲁吉亚","德国","加纳","希腊","格陵兰","格林纳达","危地马拉","几内亚","几内亚比绍","圭也那","海地","梵蒂冈","洪都拉斯","香港","匈牙利","冰岛","印度","印度尼西亚","伊朗","伊拉克","爱尔兰","以色列","意大利","牙买加","日本","约旦","哈萨克斯坦","肯尼亚","基里巴斯","科威特","吉尔吉斯斯坦","老挝","拉脱维亚","黎巴嫩","莱索托","利比里亚","利比亚","列支敦士登","立陶宛","卢森堡","澳门","马达加斯加","马拉维","马来西亚","马尔代夫","马里","马耳他","马绍尔群岛","毛里塔尼亚","毛里求斯","墨西哥","密克罗西亚","摩尔多瓦","摩纳哥","蒙古","黑山","摩洛哥","莫桑比克","缅甸","纳米比亚","瑙鲁","尼泊尔","荷兰","新西兰","尼加拉瓜","尼日尔","尼日利亚","朝鲜","北马其顿","挪威","阿曼","巴基斯坦","帕劳","巴勒斯坦","巴拿马","巴布亚新几内亚","巴拉圭","秘鲁","菲律宾","波兰","葡萄牙","卡塔尔","罗马尼亚","俄罗斯","卢旺达","圣基茨和尼维斯","圣卢西亚","圣文森特和格林纳丁斯","萨摩亚","圣马力诺","圣多美和普林西比","沙特阿拉伯","塞内加尔","塞尔维亚","塞舌尔","塞拉利昂","新加坡","斯洛伐克","斯洛文尼亚","所罗门群岛","索马里","南非","韩国","南苏丹","西班牙","斯里兰卡","苏丹","苏里南","瑞典","瑞士","叙利亚","塔吉克斯坦","坦桑尼亚","泰国","东帝汶","多哥","汤加","特立尼达和多巴哥","突尼斯","土耳其","土库曼斯坦","图瓦卢","乌干达","乌克兰","阿联酋","英国","美国","乌拉圭","乌兹别克斯坦","瓦努阿图","委内瑞拉","台湾","越南","也门","赞比亚","津巴布韦","荷属圣马丁","纽埃"]}
  ],
  otherZh: [
    {category: "动物",link: "/zh/animals", words:["狗","猫","鸟","蛇","老虎","鱼","牛","羊","猪","乌","老鼠","青蛙","马","蛇","蚊","兔","龟","蜘蛛","鲨鱼","狮","猴","长颈鹿","海蜇","蝎","鸵鸟"]},
  ]
}

export const cateTitles = [
  {key: '食物', title:'食物', dataKey: 'foodsZh'},
  {key: '地理', title:'地理', dataKey: 'geographyZh'},
  {key: '其他', title:'其他', dataKey: 'otherZh'},
]

const flattenedCategories = Object.values(cateLists).reduce(
  (accumulator, currentCategory) => [...accumulator, ...currentCategory],
  []
);

export const sortedCategories = flattenedCategories.sort((a, b) => {
  const cateA = a.category.toLowerCase();
  const cateB = b.category.toLowerCase();
  return cateA.localeCompare(cateB);
});