import React from "react";
import "../../App.scss";
import QuestionsZh from "../components/questions";

export default function AnimalsZh(){
  // const words = ["นกกระจอกเทศ","เสือดำ","ยีราฟ","แมลงวัน","แมงป่อง","แมงกะพรุน","วาฬ","พะยูน","งูเหลือม","นกพิราบ","ควาย","แรด","ตัวเงินตัวทอง","ตะกวด","จระเข้","หงส์","ห่าน","คางคก","จิ้งจก","ตุ๊กแก","แมลงสาบ","เขียด","ซาลาแมนเดอร์","นกเค้าแมว","แมวน้ำ","ม้าน้ำ","เต่าทะเล","ตะพาบ","ตะขาบ","ผึ้ง","แตน","ตัวต่อ","กระรอก","ปลาปักเป้า","ช้าง","ปู","กุ้ง","กั้ง","ลา","กระทิง","หนูนา","จิ้งหรีด","หิ่งห้อย","อึ่งอ่าง","จิ้งเหลน","จากัวร์","เสือชีต้าห์","สุนัขจิ้งจอก","จิงโจ้น้ำ","จิงโจ้","ปลาหมึก","แมลงหวี่","จั๊กจั่น","นกอินทรี","ผีเสื้อ","ด้วง","หมี","หมีขั้วโลก","ค้างคาว","งูสิง","หมู","ไก่","หอย","ตั๊กแตน","กวาง","แมลงปอ","หนอน","มด","หอยทาก","หอยลาย","เพนกวิน","เต่าทอง","งูเห่า","ไส้เดือน","นกยูง","นกนางนวล","นาก","อูฐ","ปลาดาว","แรคคูน","บีเวอร์","กิ้งก่า","ปลาดุก","กุ้งมังกร","โลมา","ปาด","ปลิง","แพนด้า","ปะการัง","เม่น","ชะมด"];
  const words = ["狗","猫","鸟","蛇","老虎","鱼","牛","羊","猪","乌","老鼠","青蛙","马","蛇","蚊","兔","龟","蜘蛛","鲨鱼","狮","猴"];
  return (<QuestionsZh answers={words} category="动物" redirect="/zh/animals"/>)
}