import React from "react";
import "../../App.scss";
import QuestionsZh from "../th/components/questions";

export default function DessertsZh(){
  // const words = ["เค้ก","ไอศกรีม","มาการอง","พาย","เมอแรงค์","มัฟฟิน","ช็อกโกแลต","เค้กนมสด","ขนมปัง","ทาร์ต","ทาร์ตไข่","โกโก้","เยลลี่","บิงซู","แพนเค้ก","คัพเค้ก","ชีสเค้ก","แยม","พานาคอตต้า","ทีรามิสุ","บราวนี่","บานอฟฟี่","ครัวซองต์","ฟองดูว์","มาร์ชเมลโล่","ลาวาเค้ก","คัสตาร์ด","คาราเมล","ท็อฟฟี่","ลูกอม","คุกกี้แอนด์ครีม","คุกกี้","บิสกิต","เดนิช","วาฟเฟิล","พายสับปะรด","พายแอปเปิล","เครป","มูส","ฟรุตสลัด","ชูครีม","เอแคลร์","ชูโรส","ชิฟฟอนเค้ก","พุดดิ้ง","มีลเฟย","มาเดอลีน","เครมบรูเล่","แอปเปิลตาแตง","ซูเฟล่","เค้กแคร์รอต","โมจิ","ดังโงะ","สโคน"];
  const words = ["蛋糕","冰淇淋","马卡龙","馅饼","เมอแรงค์","มัฟฟิน","巧克力","เค้กนมสด","面包","ทาร์ต","ทาร์ตไข่","可可","เยลลี่","บิงซู","แพนเค้ก","คัพเค้ก","ชีสเค้ก","แยม","พานาคอตต้า","ทีรามิสุ","บราวนี่","บานอฟฟี่","ครัวซองต์","ฟองดูว์","มาร์ชเมลโล่","ลาวาเค้ก","คัสตาร์ด","คาราเมล","ท็อฟฟี่","ลูกอม","คุกกี้แอนด์ครีม","คุกกี้","บิสกิต","เดนิช","วาฟเฟิล","พายสับปะรด","พายแอปเปิล","เครป","มูส","ฟรุตสลัด","ชูครีม","เอแคลร์","ชูโรส","ชิฟฟอนเค้ก","พุดดิ้ง","มีลเฟย","มาเดอลีน","เครมบรูเล่","แอปเปิลตาแตง","ซูเฟล่","เค้กแคร์รอต","โมจิ","ดังโงะ","สโคน"];
  return (<QuestionsZh answers={words} category="甜点" redirect="/zh/desserts"/>)
}