import React from "react";
import "../../App.scss";
import QuestionsTh from "../th/components/questions";

export default function DessertsTh(){
  const words = ["เค้ก","ไอศกรีม","มาการอง","พาย","เมอแรงค์","มัฟฟิน","ช็อกโกแลต","เค้กนมสด","ขนมปัง","ทาร์ต","ทาร์ตไข่","โกโก้","เยลลี่","บิงซู","แพนเค้ก","คัพเค้ก","ชีสเค้ก","แยม","พานาคอตต้า","ทีรามิสุ","บราวนี่","บานอฟฟี่","ครัวซองต์","ฟองดูว์","มาร์ชเมลโล่","ลาวาเค้ก","คัสตาร์ด","คาราเมล","ท็อฟฟี่","ลูกอม","คุกกี้แอนด์ครีม","คุกกี้","บิสกิต","เดนิช","วาฟเฟิล","พายสับปะรด","พายแอปเปิล","เครป","มูส","ฟรุตสลัด","ชูครีม","เอแคลร์","ชูโรส","ชิฟฟอนเค้ก","พุดดิ้ง","มีลเฟย","มาเดอลีน","เครมบรูเล่","แอปเปิลตาแตง","ซูเฟล่","เค้กแคร์รอต","โมจิ","ดังโงะ","สโคน"];
  return (<QuestionsTh answers={words} category="ขนมหวาน" redirect="/th/desserts"/>)
}