import React from "react";
import "../../App.scss";
import QuestionsTh from "../th/components/questions";

export default function EducationTh(){
  const words = ["คณะ","สถาปัตยกรรมศาสตร์","วิศวกรรมศาสตร์","บริหารธุรกิจ","วิทยาศาสตร์","ปริญญาโท","ปริญญาตรี","หลักสูตร","โรงเรียน","โรงเรียนมัธยม","มหาวิทยาลัย","โรงเรียนอนุบาล","โรงเรียนประถม","นักศึกษา","นักเรียน","วิชา","ทุนการศึกษา","แบบทดสอบ","ข้อสอบ","ภาคเรียน","ห้องเรียน","ครู","อาจารย์","นิเทศศาสตร์","คณิตศาสตร์","ฟิสิกส์","ชีววิทยา","เคมีวิทยา","พลศึกษา","เศรษฐศาสตร์","ภาษาศาสตร์","ศิลปศาสตร์","อักษรศาสตร์","มนุษยศาสตร์","จิตวิทยา","ระเบียบวิธี","วิทยาลัย","เทคโนโลยีสารสนเทศ","รัฐศาสตร์","นิติศาสตร์","ศิษย์เก่า","การบัญชี","การตลาด","การจัดการ","ห้องวิจัย","วิจัย","ค้นคว้าอิสระ","วิทยานิพนธ์","ปริญญาเอก","ใบประกาศนียบัตรวิชาชีพ","อนุปริญญา","เกรดเฉลี่ย","สถาบัน","แพทยศาสตร์","ศึกษา","เรียน","สอน","ภูมิศาสตร์","วิชาเลือก","สังคมวิทยา","สังคมศึกษา","สุขศึกษา","ดาราศาสตร์","ประวัติศาสตร์","วรรณคดี","วรรณกรรม","สาขาวิชา","GAT เชื่อมโยง","TCAS","สอบ","9 วิชาสามัญ"];
  return (<QuestionsTh answers={words} category="การศึกษา" redirect="/th/education"/>)
}