import React from "react";
import "../../App.scss";
import QuestionsTh from "../th/components/questions";

export default function FruitsTh(){
  const words = ["แอปเปิล","ฝรั่ง","ส้ม","มะละกอ","ชมพู่","กล้วย","ขนุน","ทุเรียน","เชอร์รี่","กระท้อน","กีวี","เงาะ","มะม่วง","แตงโม","สตรอว์เบอร์รี","สับปะรด","ลำไย","ลองกอง","ส้มโอ","สาลี่","หว้า","อะโวคาโด","มะม่วงหาวมะนาวโห่","มะยม","มะพร้าว","มะเฟือง","มะตูม","มะกอก","มะขาม","พุทรา","แพร","บลูเบอร์รี","สละ","แคนตาลูป","พีช","พลัม","มังคุด","เสาวรส","แก้วมังกร","แครนเบอร์รี","ตะลิงปลิง","น้อยหน่า","พลับ","บ๊วย","บีทรูท","ฟักทอง","มะนาว","ละมุด","ลางสาด","ราสเบอร์รี","ส้มจี๊ด","องุ่น","อินทผลัม","หูกวาง","มะไฟ","มะอึก","ระกำ","ส้มซ่า","มะปราง","อะโวคาโด","ลิ้นจี่","มะขวิด","มะดัน","ทับทิม","มะเดื่อ"];
  return (<QuestionsTh answers={words} category="ผลไม้ต่างๆ" redirect="/th/fruits"/>)
}