export const cateLists = {
  eatingLo: [
    {category: "ເຂົ້າໜົມຫວານ",link: "/lo/desserts", words:["ເຄັກ","ກະແລັມ","ມາກາຣອນ","ພາຍ","ຊັອກໂກແລັດ","ເຄັກນົມສົດ","ເຂົ້າຈີ່","ພາຍໝາກນັດ","ເຄັກໝາກກ້ຽມ","ຄຸກກີ","ເຂົ້າໜົມອຶ່ງ","ເຄບ","ບິງຊູ"]},
    {category: "ເຄື່ອງດື່ມ",link: "/lo/drinks", words:["ນ້ຳດື່ມ","ຊາ","ກາເຟ","ຄາປູຊິໂນ","ອະເມຣິກາໂນ","ນົມ","ນ້ຳປັ່ນ","ໂຊດາ","ເບຍ","ເຫຼົ້າແວງ","ເອສເປຣສໂຊ","ນ້ຳໝາກກ້ຽງ","ນ້ຳໝາກໄມ້","ນ້ຳໝາກໂປມ","ນ້ຳໝາກນາວ","ໂຊຈູ","ນ້ຳໝາກພ້າວ","ນົມຖົ່ວເຫຼືອງ","ຊານົມ","ຊາໝາກນາວ","ລາເຕ້","ນົມສົ້ມ","ໂກໂກ້","ແຊມເປນ","ເຫຼົ້າ","ຊາຂຽວ","ຊາດຳ","ຊາຂາວ","ກາເຟດຳ","ນ້ຳຂິງ","ເຫຼົ້າຂາວ","ນ້ຳໝາກໜອດ","ມ໋ອກຄາ"]},
    {category: "ອາຫານ",link: "/lo/foods", words:["ສະຫຼັດ","ເຂົ້າ","ໄຂ່ຂົ້ວ","ຕຳໝາກຫຸ່ງ","ລາບ","ເອາະຫຼາມ","ປາແດກ","ແຈ່ວບອງ","ໄຄແຜ່ນ","ເຝີ","ເຂົ້າປຸ້ນ","ເຂົ້າປຽກ","ກິມຈິ","ສະເຕັກ","ໄຂ່ດາວ","ໄຂ່ຕົ້ມ","ເຂົ້າຜັດ","ແກງ","ແກງໜໍ່ໄມ້","ປີ້ງໄກ່","ຈືນໄກ່","ປາເຜົາ","ໄສ້ອົ່ວ","ເປັດປັກກິ່ງ","ໝາລ່າ","ພິດຊ່າ","ຊູຊິ","ຕຳຫຼວງພະບາງ","ແຊນວິດ","ເບີເກີ້","ເຂົ້າໜຽວ","ໂລຕີ"]},
  ],
  geographyLo: [
    {category: "ແຂວງໃນປະເທດລາວ",link: "/lo/laos-provinces", words:["ວຽງຈັນ","ນະຄອນຫຼວງວຽງຈັນ","ຫຼວງພະບາງ","ໄຊສົມບູນ","ຄຳມ່ວນ","ຈຳປາສັກ","ສາລະວັນ","ສະຫວັນນະເຂດ","ຊຽງຂວາງ","ໄຊຍະບູລີ","ເຊກອງ","ບໍລິຄຳໄຊ","ບໍ່ແກ້ວ","ຜົ້ງສາລີ","ຫຼວງນ້ຳທາ","ອັດຕະປື","ອຸດົມໄຊ","ຫົວພັນ"]},
    {category: "ສະຖານທີ່",link: "/lo/places", words:["ໂຮງຮຽນ","ໂຮງໝໍ","ໂຮງແຮມ","ຮ້ານອາຫານ","ເຮືອນ","ຕະຫຼາດ","ສະໜາມບິນ","ຫ້າງສັບພະສິນຄ້າ","ສວນສັດ","ວັດ","ໂຮງພັກ","ສະໜາມກີລາ","ໂຮງລະຄອນ","ໂຮງໜັງ","ພິພິທະພັນ","ສຳນັກງານ","ມະຫາວິທະຍາໄລ","ວິທະຍາໄລ","ສວນສາທາລະນະ","ຮ້ານກາເຟ","ນ້ຳຕົກຕາດ","ປ່າ","ຖ້ຳ"]}
  ],
  otherLo: [
    {category: "ເຄື່ອງຄົວ",link: "/lo/kitchenware", words:["ໄມ້ຖູ່","ບ່ວງ","ສ້ອມ","ມີດ","ໝໍ້","ຈານ","ຈອກ","ຕູ້ເຢັນ","ໂຖ","ແຊ່ຂົ້ວ","ເຕົາອົບ","ໝໍ້ຫຸງຂ້າວ","ແກ້ວ","ໄຫ","ຊາມ","ຂຽງ","ຕະຫຼິວ"]},
    {category: "ສັດຕ່າງໆ",link: "/lo/animals", words:["ໝາ","ແມວ","ນົກ","ກົບ","ງູ","ເສືອ","ສິງໂຕ","ຍຸງ","ເສືອດຳ","ແມງມຸມ","ປາ","ງົວ","ໝູ","ໄກ່","ແກະ","ແພະ","ກວາງ","ຊ້າງ","ລິງ","ໜູ","ມ້າ","ມ້າລາຍ","ແມງໄມ້","ເຜິ້ງ","ນົກອິນຊີ","ກະຕ່າຍ","ກະຮອກ","ປາດາວ","ສະຫຼາມ","ນົກຍູງ","ເປັດ","ປາມຶກ"]},
  ],
}

const flattenedCategories = Object.values(cateLists).reduce(
  (accumulator, currentCategory) => [...accumulator, ...currentCategory],
  []
);

export const sortedCategories = flattenedCategories.sort((a, b) => {
  const cateA = a.category.toLowerCase();
  const cateB = b.category.toLowerCase();
  return cateA.localeCompare(cateB);
});