import React from "react";
import "../../App.scss";
import QuestionsZh from "../th/components/questions";

export default function EducationZh(){
  const words = ["คณะ","สถาปัตยกรรมศาสตร์","课程学","บริหารธุรกิจ","วิทยาศาสตร์","ปริญญาโท","ปริญญาตรี","หลักสูตร","学校","โรงเรียนมัธยม","大学","โรงเรียนอนุบาล","โรงเรียนประถม","นักศึกษา","นักเรียน","วิชา","ทุนการศึกษา","แบบทดสอบ","ข้อสอบ","ภาคเรียน","ห้องเรียน","ครู","อาจารย์","นิเทศศาสตร์","คณิตศาสตร์","ฟิสิกส์","ชีววิทยา","เคมีวิทยา","พลศึกษา","เศรษฐศาสตร์","ภาษาศาสตร์","ศิลปศาสตร์","อักษรศาสตร์","มนุษยศาสตร์","จิตวิทยา","ระเบียบวิธี","วิทยาลัย","เทคโนโลยีสารสนเทศ","รัฐศาสตร์","นิติศาสตร์","ศิษย์เก่า","การบัญชี","การตลาด","การจัดการ","ห้องวิจัย","วิจัย","ค้นคว้าอิสระ","วิทยานิพนธ์","ปริญญาเอก","ใบประกาศนียบัตรวิชาชีพ","อนุปริญญา","เกรดเฉลี่ย","สถาบัน","แพทยศาสตร์","ศึกษา","เรียน","สอน","ภูมิศาสตร์","วิชาเลือก","สังคมวิทยา","สังคมศึกษา","สุขศึกษา","ดาราศาสตร์","ประวัติศาสตร์","วรรณคดี","วรรณกรรม","สาขาวิชา","GAT เชื่อมโยง","TCAS","สอบ","9 วิชาสามัญ"];
  return (<QuestionsZh answers={words} category="教育" redirect="/zh/education"/>)
}