import React from "react";
import "../../App.scss";
import QuestionsZh from "../th/components/questions";

export default function KitchenwareTh(){
  const words = ["杯子","锅子","กระทะ","กระบวย","叉子","勺子","刀子","ปังตอ","กระทะใบบัว","ตะแกรง","ครก","สาก","ทัพพี","ตะหลิว","ชาม","盘子","ถาด","เขียง","หม้อหุงข้าว","ไมโครเวฟ","เครื่องปั่น","หม้อทอดไร้น้ำมัน","ตู้เย็น","เตาอบ","หม้อนึ่ง","พิมพ์อบขนม","ตู้กับข้าว","เครื่องปั่นอาหาร","กระชอน","ที่เปิดขวด","ตะกร้อมือ","ที่คีบ","ตะแกรง","ตะกร้อลวก","กระติกน้ำร้อน","คูลเลอร์","เครื่องชั่งน้ำหนัก","ที่ปอกเปลือก","ถุงมือ","หินลับมีด","ผ้ากันเปื้อน","เตา","เตาแก๊ส","เครื่องปิ้งขนมปัง","เครื่องทำวาฟเฟิล"];
  return (<QuestionsZh answers={words} category="厨具" redirect="/zh/kitchenware"/>)
}